/* Розробіть програму, в якій з клавіатури вводиться масив цілих чисел заданого розміру, виконуються задані обчислення. 
На екран виводяться значення елементів масиву і результати обчислень.

Обчисліть середнє арифметичне тільки ненульових елементів. Розмір масиву 6.
*/

#include <stdio.h>
#include <stdlib.h>

int main() {
    int arr[6];
    printf("Введіть 6 елементів масиву:\n");
    for (int i = 0; i < 6; i++) {
        scanf("%d", &arr[i]);
    }
    int sum = 0;
    int count = 0;
    for (int i = 0; i < 6; i++) { 
        if (arr[i] != 0) {
            sum += arr[i];
            count++;
        } 
    }
    sum /= count;
    printf("Середнє арифметичне: %d\n", sum);

    return 0;

}

    