/*  
Розробіть програму, в якій визначається масив цілих чисел заданого розміру. Перший елемент масиву задається, всі інші 
елементи вводяться з клавіатури, потім виконуються скра воятеня, користову малод у сту да ти емнсів масиву через розіменувания покажчика. На
1. Визначте мінімальний елемент масиву, що кратний 5. Перший елемент масиву дорівнює 500. Розмір масиву 8.
 */

 #include<stdio.h>

 int main() {
    const int n = 8;
    int arr[n];
    int *p = arr;   // покажчик на масив
    *p = 500;   

    printf("Введіть ще %d елементів масиву:\n", n - 1);
    for (int i = 1; i < n; i++) {
        scanf("%d", p + i);   // вводимо за адресою (p+i)
    }

    int min = *p;  

    for (int i = 0; i < n; i++) {
        int val = *(p + i);   // значення елемента через покажчик
        if (val % 5 == 0 && val < min && val != 0) {
            min = val;
        }
    }

     printf("Мінімальний елемент масиву, кратний 5 = %d\n", min);

    return 0;
 }
